import type { Inflection } from '../src/inflect';

const cases: [string, [Inflection['case'], string, string][]][] = [
  [
    'мо 1a',
    [
      ['nom', '', 'ы'],
      ['gen', 'а', 'ов'],
      ['dat', 'у', 'ам'],
      ['acc', 'а', 'ов'],
      ['ins', 'ом', 'ами'],
      ['prp', 'е', 'ах'],
    ],
  ],
  [
    'м 1a',
    [
      ['nom', '', 'ы'],
      ['gen', 'а', 'ов'],
      ['dat', 'у', 'ам'],
      ['acc', '', 'ы'],
      ['ins', 'ом', 'ами'],
      ['prp', 'е', 'ах'],
    ],
  ],
  [
    'мо 2a',
    [
      ['nom', 'ь', 'и'],
      ['gen', 'я', 'ей'],
      ['dat', 'ю', 'ям'],
      ['acc', 'я', 'ей'],
      ['ins', 'ем', 'ями'],
      ['prp', 'е', 'ях'],
    ],
  ],
  [
    'м 2a',
    [
      ['nom', 'ь', 'и'],
      ['gen', 'я', 'ей'],
      ['dat', 'ю', 'ям'],
      ['acc', 'ь', 'и'],
      ['ins', 'ем', 'ями'],
      ['prp', 'е', 'ях'],
    ],
  ],
  [
    'жо 1a',
    [
      ['nom', 'а', 'ы'],
      ['gen', 'ы', ''],
      ['dat', 'е', 'ам'],
      ['acc', 'у', ''],
      ['ins', 'ой', 'ами'],
      ['prp', 'е', 'ах'],
    ],
  ],
  [
    'ж 1a',
    [
      ['nom', 'а', 'ы'],
      ['gen', 'ы', ''],
      ['dat', 'е', 'ам'],
      ['acc', 'у', 'ы'],
      ['ins', 'ой', 'ами'],
      ['prp', 'е', 'ах'],
    ],
  ],
  [
    'жо 2a',
    [
      ['nom', 'я', 'и'],
      ['gen', 'и', 'ь'],
      ['dat', 'е', 'ям'],
      ['acc', 'ю', 'ь'],
      ['ins', 'ей', 'ями'],
      ['prp', 'е', 'ях'],
    ],
  ],
  [
    'ж 2a',
    [
      ['nom', 'я', 'и'],
      ['gen', 'и', 'ь'],
      ['dat', 'е', 'ям'],
      ['acc', 'ю', 'и'],
      ['ins', 'ей', 'ями'],
      ['prp', 'е', 'ях'],
    ],
  ],
  [
    'со 1a',
    [
      ['nom', 'о', 'а'],
      ['gen', 'а', ''],
      ['dat', 'у', 'ам'],
      ['acc', 'о', ''],
      ['ins', 'ом', 'ами'],
      ['prp', 'е', 'ах'],
    ],
  ],
  [
    'с 1a',
    [
      ['nom', 'о', 'а'],
      ['gen', 'а', ''],
      ['dat', 'у', 'ам'],
      ['acc', 'о', 'а'],
      ['ins', 'ом', 'ами'],
      ['prp', 'е', 'ах'],
    ],
  ],
  [
    'с 2a',
    [
      ['nom', 'е', 'я'],
      ['gen', 'я', 'ь'],
      ['dat', 'ю', 'ям'],
      ['acc', 'е', 'я'],
      ['ins', 'ем', 'ями'],
      ['prp', 'е', 'ях'],
    ],
  ],
];

export { cases };
