import type { Inflection } from '../src/inflect';

const cases: [string, string, [Inflection['case'], string, string][]][] = [
  [
    'сон',
    'м 1*b',
    [
      ['nom', 'сон', 'сны'],
      ['gen', 'сна', 'снов'],
      ['dat', 'сну', 'снам'],
      ['acc', 'сон', 'сны'],
      ['ins', 'сном', 'снами'],
      ['prp', 'сне', 'снах'],
    ],
  ],
  [
    'любовь',
    "ж 8*b'",
    [
      ['nom', 'любовь', 'любви'],
      ['gen', 'любви', 'любвей'],
      ['dat', 'любви', 'любвям'],
      ['acc', 'любовь', 'любви'],
      ['ins', 'любовью', 'любвями'],
      ['prp', 'любви', 'любвях'],
    ],
  ],
  [
    'бубен',
    'm ina 1*a',
    [
      ['nom', 'бубен', 'бубны'],
      ['gen', 'бубна', 'бубнов'],
      ['dat', 'бубну', 'бубнам'],
      ['acc', 'бубен', 'бубны'],
      ['ins', 'бубном', 'бубнами'],
      ['prp', 'бубне', 'бубнах'],
    ],
  ],
  [
    'свёкор',
    'm a 1a',
    [
      ['nom', 'свёкор', 'свёкоры'],
      ['gen', 'свёкора', 'свёкоров'],
      ['dat', 'свёкору', 'свёкорам'],
      ['acc', 'свёкора', 'свёкоров'],
      ['ins', 'свёкором', 'свёкорами'],
      ['prp', 'свёкоре', 'свёкорах'],
    ],
  ],
  [
    'улей',
    'm ina 6*a',
    [
      ['nom', 'улей', 'ульи'],
      ['gen', 'улья', 'ульев'],
      ['dat', 'улью', 'ульям'],
      ['acc', 'улей', 'ульи'],
      ['ins', 'ульем', 'ульями'],
      ['prp', 'улье', 'ульях'],
    ],
  ],
  [
    'зверёк',
    'm a 3*b',
    [
      ['nom', 'зверёк', 'зверьки'],
      ['gen', 'зверька', 'зверьков'],
      ['dat', 'зверьку', 'зверькам'],
      ['acc', 'зверька', 'зверьков'],
      ['ins', 'зверьком', 'зверьками'],
      ['prp', 'зверьке', 'зверьках'],
    ],
  ],
  [
    'лёд',
    'm ina 1*b',
    [
      ['nom', 'лёд', 'льды'],
      ['gen', 'льда', 'льдов'],
      ['dat', 'льду', 'льдам'],
      ['acc', 'лёд', 'льды'],
      ['ins', 'льдом', 'льдами'],
      ['prp', 'льде', 'льдах'],
    ],
  ],
  [
    'палец',
    'm ina 5*a',
    [
      ['nom', 'палец', 'пальцы'],
      ['gen', 'пальца', 'пальцев'],
      ['dat', 'пальцу', 'пальцам'],
      ['acc', 'палец', 'пальцы'],
      ['ins', 'пальцем', 'пальцами'],
      ['prp', 'пальце', 'пальцах'],
    ],
  ],
  [
    'орёл',
    'm a 1*b',
    [
      ['nom', 'орёл', 'орлы'],
      ['gen', 'орла', 'орлов'],
      ['dat', 'орлу', 'орлам'],
      ['acc', 'орла', 'орлов'],
      ['ins', 'орлом', 'орлами'],
      ['prp', 'орле', 'орлах'],
    ],
  ],
];

export { cases };
