import type { Inflection } from '../src/inflect';

const cases: [string, string, [Inflection['case'], string, string][]][] = [
  [
    'артист',
    'мо 1a',
    [
      ['nom', 'артист', 'артисты'],
      ['gen', 'артиста', 'артистов'],
      ['dat', 'артисту', 'артистам'],
      ['acc', 'артиста', 'артистов'],
      ['ins', 'артистом', 'артистами'],
      ['prp', 'артисте', 'артистах'],
    ],
  ],
  [
    'парта',
    'ж 1a',
    [
      ['nom', 'парта', 'парты'],
      ['gen', 'парты', 'парт'],
      ['dat', 'парте', 'партам'],
      ['acc', 'парту', 'парты'],
      ['ins', 'партой', 'партами'],
      ['prp', 'парте', 'партах'],
    ],
  ],
  [
    'горе',
    'с 2a',
    [
      ['nom', 'горе', 'горя'],
      ['gen', 'горя', 'горь'],
      ['dat', 'горю', 'горям'],
      ['acc', 'горе', 'горя'],
      ['ins', 'горем', 'горями'],
      ['prp', 'горе', 'горях'],
    ],
  ],
];

export { cases };
